stylish_shades_api/app/controllers/sunglasses_controller.rb

SELECT "sunglasses".* FROM "sunglasses" WHERE "sunglasses"."category_id" = ?  [["category_id", 2]]
---
  def index
    @sunglasses = Sunglass.where("category_id = ?", params[:id])

UPDATE "sunglasses" SET "stock_quantity" = ?, "updated_at" = ? WHERE "sunglasses"."id" = ?  [["stock_quantity", 19], ["updated_at", "2020-12-03 02:14:13.019650"], ["id", 2]]
---
  def update
    if @sunglass.update(sunglass_params)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_category
    @category = Category.find_by_id(params[:category_id])

SELECT "sunglasses".* FROM "sunglasses" WHERE "sunglasses"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_sunglass
    @category_sunglass = @category.sunglasses.find_by_id(params[:id])