stylish_shades_api/app/controllers/sunglasses_controller.rb

SELECT "sunglasses".* FROM "sunglasses"
---
  def index
    @sunglasses = Sunglass.all